import { ImageBackground, SafeAreaView, ScrollView, Text, View } from 'react-native';
import React from 'react';
import image from '@/constants/image';

export default function support() {
  return (
     <SafeAreaView className="flex-1">
        <ImageBackground source={image.phonBlueW} className="flex-1 w-full h-full items-center justify-center px-6" resizeMode="cover">
          <ScrollView showsVerticalScrollIndicator={false}>
        <View className='mt-6'>
          <Text className="text-blue-900 text-xl font-ubuntu-bold">Останнє оновлення: 06/05/2025</Text>

          <Text className="text-blue-900 text-lg font-ubuntu-regular">
            {"\n"}1. Загальні положення
            {"\n"}
            Додаток CalMi створений для осіб віком від 16 років і надає користувачам доступ до психологічних матеріалів: дихальних вправ, психологічних тестів та тематичних статей, а також можливість звернутися по допомогу через гарячу лінію або чат, що надається нашими перевіреними партнерами.
            {"\n\n"}
            Користуючись цим додатком, ви погоджуєтеся з викладеними нижче правилами.
          </Text>

          <Text className="text-blue-900 text-lg font-ubuntu-regular">
            {"\n"} 2. Не є заміною професійної допомоги
            {"\n"}
            Додаток «CalMi» не є медичним або психотерапевтичним засобом і не замінює консультацію з лікарем, психіатром чи кваліфікованим психологом. {"\n"}У разі гострого емоційного чи психічного стану рекомендуємо негайно звернутись до фахівця або екстрених служб.
          </Text>

          <Text className="text-blue-900 text-lg font-ubuntu-regular">
            {"\n"}3. Вік користувачів
            {"\n"}
            Додатком дозволено користуватися лише особам, які досягли 16 років. Використання особами, молодшими за цей вік, заборонене.
          </Text>

          <Text className="text-blue-900 text-lg font-ubuntu-regular">
            {"\n"}4. Персональні дані
            {"\n"}
            Під час реєстрації або користування додатком можуть збиратись такі персональні дані:
            {"\n\n"}
           - Ім’я
            {"\n"}
           - Електронна пошта
            {"\n"}
           - Стать
            {"\n"}
           - Дата народження
            {"\n\n"}
            Ці дані використовуються виключно для покращення користувацького досвіду та персоналізації контенту. {"\n\n"}Ми суворо дотримуємось політики конфіденційності та не передаємо ваші дані третім сторонам без вашої згоди.
          </Text>

          <Text className="text-blue-900 text-lg font-ubuntu-regular">
            {"\n"}5. Платні функції
            {"\n"}
            Додаток пропонує три види підписки, які можуть відкривати додаткові можливості. Інформація про типи підписок, їхню вартість та функціонал надається у відповідному розділі додатку. Ви можете керувати своєю підпискою через налаштування облікового запису.
          </Text>

          <Text className="text-blue-900 text-lg font-ubuntu-regular">
           {"\n"} 6. Поведінка користувача
            {"\n"}
            Користувачам забороняється:
            {"\n\n"}
            - Поширювати неправдиву або шкідливу інформацію
            {"\n"}
            - Використовувати додаток для цькування, переслідування чи образ інших осіб
            {"\n"}
            - Використовувати чужі персональні дані або видавати себе за іншу особу
            {"\n"}
            - Втручатися в роботу сервісу (хакерство, спам тощо)
            {"\n\n"}
            Порушення цих правил може призвести до блокування доступу до додатку без попередження.
          </Text>

          <Text className="text-blue-900 text-lg font-ubuntu-regular">
            {"\n"}7. Служба підтримки
            {"\n"}
            Якщо у вас виникли питання, проблеми з доступом або скарги, будь ласка, звертайтесь до нашої служби підтримки:
            {"\n\n"}
            📧 calmihealth@gmail.com
            {"\n"}
            📞 + 380 98 6546 564
          </Text>

          <Text className="text-blue-900 text-lg font-ubuntu-bold mb-4 text-center">
            {"\n"}Ми залишаємо за собою право змінювати ці Правила в будь-який час. Оновлена версія буде доступна в додатку, і користувачі будуть проінформовані про важливі зміни.
          </Text>
        </View>
      </ScrollView>
     </ImageBackground>
  </SafeAreaView>
  );
}
